fix: switch diagrams to mermaid
